       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO, WORLD!'.
           STOP RUN.